src/Catalogs/ВидыЗапасов/ВидыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗапасов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияЗапасовДругойОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗапасовВладельца</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>EnumRef.СпособыПередачиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ТипыПредназначенияВидовЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыЗапасов/ТипыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗапасов</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйТовар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>АгентскаяУслуга</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыОперацийВводаОстатков/ТипыОперацийВводаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийВводаОстатков</name>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМПоРозничнойВыручке</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПодотчетников</name>
  </enumValues>
  <enumValues>
    <name>УДАЛИТЬОстаткиЗадолженностиПодотчетниковПоНаличнымРасчетам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНаБанковскихСчетах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоАвансам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоРеализациям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОстаткиСобственныхТоваровНаАдресномСкладе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПереданныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПолученныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОстаткиТоваровПолученныхНаКомиссиюНаАдресномСкладе</name>
  </enumValues>
  <enumValues>
    <name>ПерерасходыПодотчетныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СторноОтчетовПоЭквайрингу</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПереданнойКлиентам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПринятойОтПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОстаткиВозвратнойТарыПринятойОтПоставщиковНаАдресномСкладе</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеАдресногоХраненияОстатков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеСкладскихПомещений</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоДоговорамКредитовИДепозитов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхПереработчикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыйРезультатЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОптовыеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>РозничныеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиАрендованныхОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВзаиморасчетовПоДоговорамЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ВременнаяРазницаОСЗа2020</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВидыЗапасов/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("ХозяйственнаяОперация") Тогда
			Если Параметры.Отбор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию
			 ИЛИ Параметры.Отбор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию Тогда
				Параметры.Отбор.Вставить("ТипЗапасов", Перечисления.ТипыЗапасов.КомиссионныйТовар);
			Иначе
				Параметры.Отбор.Вставить("ТипЗапасов", Перечисления.ТипыЗапасов.Товар);
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ТипОперации") Тогда
			Если Параметры.Отбор.ТипОперации = Перечисления.ТипыОперацийВводаОстатков.ОстаткиТоваровПолученныхНаКомиссию
			 ИЛИ Параметры.Отбор.ТипОперации = Перечисления.ТипыОперацийВводаОстатков.УдалитьОстаткиТоваровПолученныхНаКомиссиюНаАдресномСкладе Тогда
				Параметры.Отбор.Вставить("ТипЗапасов", Перечисления.ТипыЗапасов.КомиссионныйТовар);
			Иначе
				Параметры.Отбор.Вставить("ТипЗапасов", Перечисления.ТипыЗапасов.Товар);
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда
			ГруппаФинансовогоУчета = Справочники.Номенклатура.ЗначенияРеквизитовНоменклатуры(Параметры.Отбор.Номенклатура).ГруппаФинансовогоУчета;
			МассивГрупп = Новый Массив;
			МассивГрупп.Добавить(ГруппаФинансовогоУчета);
			МассивГрупп.Добавить(Справочники.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка());
			Параметры.Отбор.Вставить("ГруппаФинансовогоУчета", МассивГрупп);
		КонецЕсли;
		
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
